betamoojw/BETTA-HA-PANEL-10-Guiton-JC8012P4A1C/sdkconfig.defaults
# SPDX-License-Identifier: LicenseRef-FNCL-1.1
# Copyright (c) 2026 Cpt_Kirk
# Core behavior defaults for development

# Target chip: ESP32-P4 (host) + ESP32-C6 (Wi-Fi coprocessor).
# Declared here so a fresh clone builds without `idf.py set-target esp32p4`.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# Use custom partition table with OTA slots and LittleFS storage partition
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# ESP-Hosted over SDIO (ESP32-P4 host + ESP32-C6 coprocessor)
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
# CONFIG_ESP_HOSTED_SPI_HOST_INTERFACE is not set
# CONFIG_ESP_HOSTED_SPI_HD_HOST_INTERFACE is not set
# CONFIG_ESP_HOSTED_UART_HOST_INTERFACE is not set
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
# CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD is not set
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_RESET_DELAY_MS=1500
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_MAX_SIZE is not set
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_NONE is not set

# User provided ESP-Hosted SDIO wiring
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=18
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=19
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=14
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=15
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=16
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
# CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW is not set
# CONFIG_ESP_HOSTED_RESET_GPIO_ACTIVE_LOW is not set

# Recommended Wi-Fi remote tuning for P4 + C6
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# Recommended LWIP mailbox/window sizing for Hosted Wi-Fi use-cases
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_TCP_MSS=1200
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
# P4 internal DMA heap is small (~70 KiB) and esp_hosted SDIO ACKs need
# MALLOC_CAP_INTERNAL|DMA buffers.  A 16 KiB receive window lets HA burst a
# full 1 MiB entity-registry response, flooding ACKs until the DMA heap is
# exhausted ("STA TX buffer alloc failed").  4 KiB (~3 MSS) paces the inbound
# stream so ACKs are generated slower than the SDIO path drains them.
CONFIG_LWIP_TCP_WND_DEFAULT=4096
CONFIG_LWIP_TCP_SACK_OUT=y

# Keep station-only footprint for MVP
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Internal-memory pressure tuning:
# esp_hosted SDIO RX + mbedTLS AES DMA require MALLOC_CAP_INTERNAL|DMA.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y

# PSRAM profile (Hex mode @ 200MHz).
# Both the 4" (ESP32-P4-WIFI6-Touch-LCD-4B) and 10.1" (Waveshare Nano) boards
# ship with 16/32MB Hex PSRAM; ESP-Hosted + LVGL draw buffers cannot fit in
# internal RAM on either variant. Keep this in the common defaults.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_SPEED=200
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_FLASH_LOAD_TO_PSRAM=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_PRE_CONFIGURE_MEMORY_PROTECTION=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# --- LVGL allocator: C-lib (PSRAM-capable) instead of 64KB TLSF pool ---
# Required for both variants: the 64KB built-in pool cannot absorb label
# reflow / vector-graphic allocations, which manifests as an infinite
# update_layout_completed_cb loop -> task WDT in lv_array_resize.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y


# Reduce peak TLS memory to avoid DMA descriptor allocation failures
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# IN buffer must fit full todo.get_items WebSocket responses (both variants).
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Reuse TLS sessions across HTTP reconnects to avoid full handshakes
# (saves ~2-4 kB internal heap + ~150 ms per reconnect on Home Assistant)
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y

# App defaults
CONFIG_APP_WIFI_DISABLE_POWER_SAVE=y
CONFIG_APP_HA_FETCH_INITIAL_STATES=y
CONFIG_APP_HA_SUBSCRIBE_STATE_CHANGED=y
CONFIG_APP_HA_PING_INTERVAL_MS=30000

# Keep hosted C6 out of Wi-Fi 6 TWT power-save behavior
# CONFIG_ESP_HOSTED_ENABLE_ITWT is not set

# Disable ESP-Hosted host-side power-save/deep-sleep. The P4 host has no wake GPIO wired.
# CONFIG_ESP_HOSTED_HOST_POWER_SAVE_ENABLED is not set
# CONFIG_ESP_HOSTED_HOST_DEEP_SLEEP_ALLOWED is not set

# Keep remote station PM fully disabled for long-lived websocket links
# CONFIG_WIFI_RMT_STA_DISCONNECTED_PM_ENABLE is not set
# CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE is not set

# Runtime tiny_ttf disabled: icons are provided by generated static LVGL font C-array.
# CONFIG_LV_USE_TINY_TTF is not set
CONFIG_LV_USE_VECTOR_GRAPHIC=y
CONFIG_LV_USE_FLOAT=y
CONFIG_LV_USE_MATRIX=y
CONFIG_LV_USE_THORVG=y
CONFIG_LV_USE_THORVG_INTERNAL=y
CONFIG_LV_USE_LOTTIE=y
CONFIG_LV_USE_LODEPNG=y

# Display/LVGL performance profile for ESP32-P4 + DSI
CONFIG_LVGL_PORT_ENABLE_PPA=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
# CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH is not set
CONFIG_BSP_DISPLAY_LVGL_DIRECT_MODE=y
CONFIG_LV_DEF_REFR_PERIOD=16

# Heating tile typography + UI fonts used by smart86 layouts
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_34=y
# Poppins fonts (poppins_regular_12..28.c) are stored RLE-compressed (bitmap_format=1).
# Without this the decompressor is compiled out and every Poppins glyph renders blank.
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_LV_USE_SNAPSHOT=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360
